
# Token telegran bot
bot_token = '1231242426:AAH5S_K35fiiuSS1LLpBryon7YL35OogIZc' # токен бота
CHANNEL_ID = 1229417049 # id канала куда будет отсылаться информация, ид без -100 в начале (например: 124873248)

# ID admin
admin_id = 700197342 # id админа

bot_login = '@ASB_SHOP_BOT' # логин бота
ref_percent = 10 # Процент реферальной системы

QIWI_NUMBER = '+79069634609'    # номер киви
QIWI_TOKEN = 'bb8c436793ad52b225a36440a8ef7343'            # токен киви

text_purchase = '❕ Вы выбрали: ' \
                '{name}\n\n' \
                '{info}\n\n' \
                '💠 Цена: {price} рублей\n' \
                '💠 Кол-во товара: {amount}' \


# инфа
info = '''❗️Полезные ссылки:\n\'  
⚠️ Помощь/Замена: @manageraccountshop\n
💳 Оплата BTC: @manageraccountshop\n
✅ Группа с отзывами: @ASB_GROUP\n'''

# Пополнение баланса
replenish_balance = '⚠️ Пополнение баланса\n\n' \
                    '🥝 Оплата киви: \n\n' \
                    '⚠️ Скопируйте комментарий 👇\n' \
                    '🧩 Комментарий  {code}\n' \
                    '✅ Оплатите по ссылке: https://qiwi.com/n/ACCOUNTSTOREBOT'

# Профиль
profile = '🧾 Профиль\n\n' \
          '❕ Ваш id - {id}\n' \
          '❕ Ваш логин - {login}\n' \
          '❕ Дата регистрации - {data}\n\n' \
          '💰 Ваш баланс - {balance} рублей'
